exp-3-merge-sort-final/build/docs/plan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>plan</title>
<!-- 2017-08-29 Tue 09:36 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="kanay" />
</head>
<body>
<div id="content">
<h1 class="title">plan</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Merge sort experiment 3</a></li>
<li><a href="#sec-2">2. Problems faced while implementing</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Merge sort experiment 3</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>In the 3rd version we will use dagre-d3.js a library based on d3 itself.
</li>
<li>The tree would be generated using dagre.
</li>
<li>The split nodes will be generated using the binary logic of having children of index i as 2*i+1 and 2*i+2.
</li>
<li>After everything is splitted then merging will begin.
</li>
<li>Merge function will be modified to accomodate formation of nodes.
</li>
<li>All the ID's will be mapped so as to obtain the data each node represents anytime.
</li>
<li>Then merging of nodes would be done.
</li>
<li>No definite logic is there so would go for hard coding i.e. brute force for merge.
</li>
<li>Will look for logic for merging as time passes by.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Problems faced while implementing</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Problem in generating splits on button clicks.
<ul class="org-ul">
<li>This can be done using the row numbers as the nodes are marked using binary logic.
</li>
<li>Just use the row number and generate all the nodes that can be there in this row and see if they exist using the visited array.
</li>
<li>Draw edges accordingly.
</li>
</ul>
</li>
<li>But use the graph as a local variable then as the global cannot be altered again and again - solution: a reset function for resetting all the local variables.
</li>
<li>No definite logic for merging was found so had to hard code i.e. use brute force for merge.
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: kanay</p>
<p class="date">Created: 2017-08-29 Tue 09:36</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
